{
  "activity:archivermain": "The archiver process is waiting for activity.",
  "activity:autovacuummain": "The autovacuum launcher process is waiting for activity.",
  "activity:bgwriterhibernate": "The background writer process is hibernating while waiting for activity.",
  "activity:bgwritermain": "The background writer process is waiting for activity.",
  "activity:checkpointermain": "The checkpointer process is waiting for activity.",
  "activity:logicalapplymain": "The logical replication apply process is waiting for activity.",
  "activity:logicallaunchermain": "The logical replication launcher process is waiting for activity.",
  "activity:pgstatmain": "The statistics collector process is waiting for activity.",
  "activity:recoverywalall": "A process is waiting for the write-ahead log (WAL) from a stream at recovery.",
  "activity:recoverywalstream": "The startup process is waiting for the write-ahead log (WAL) to arrive during streaming recovery.",
  "activity:sysloggermain": "The syslogger process is waiting for activity.",
  "activity:walreceivermain": "The write-ahead log (WAL) receiver process is waiting for activity.",
  "activity:walsendermain": "The write-ahead log (WAL) sender process is waiting for activity.",
  "activity:walwritermain": "The write-ahead log (WAL) writer process is waiting for activity.",
  "bufferpin:bufferpin": "A process is waiting to acquire an exclusive pin on a buffer.",
  "client:gssopenserver": "A process is waiting to read data from the client while establishing a Generic Security Service Application Program Interface (GSSAPI) session.",
  "client:clientread": "A backend process is waiting to receive data from a PostgreSQL client. For more information, see Client:ClientRead.",
  "client:clientwrite": "A backend process is waiting to send more data to a PostgreSQL client. For more information, see Client:ClientWrite.",
  "client:libpqwalreceiverconnect": "A process is waiting in the write-ahead log (WAL) receiver to establish connection to remote server.",
  "client:libpqwalreceiverreceive": "A process is waiting in the write-ahead log (WAL) receiver to receive data from remote server.",
  "client:sslopenserver": "A process is waiting for Secure Sockets Layer (SSL) while attempting connection.",
  "client:walreceiverwaitstart": "A process is waiting for startup process to send initial data for streaming replication.",
  "client:walsenderwaittforwal": "A process is waiting for the write-ahead log (WAL) to be flushed in the WAL sender process.",
  "client:walsenderwritedata": "A process is waiting for any activity when processing replies from the write-ahead log (WAL) receiver in the WAL sender process.",
  "cpu": "A backend process is active in or is waiting for CPU. For more information, see CPU.",
  "extension:extension": "A backend process is waiting for a condition defined by an extension or module.",
  "io:auroraoptimizedreadscacheread": "A process is waiting for a read from Optimized Reads tiered cache because the page isn't available in shared memory.",
  "io:auroraoptimizedreadscachesegmenttruncate": "A process is waiting for an Optimized Reads tiered cache segment file to be truncated.",
  "io:auroraoptimizedreadscachewrite": "The background writer process is waiting to write in Optimized Reads tiered cache.",
  "io:aurorastoragealogallocate": "A session is allocating metadata and preparing for a transaction log write.",
  "io:buffileread": "When operations require more memory than the amount defined by working memory parameters, the engine creates temporary files on disk. This wait event occurs when operations read from the temporary files. For more information, see IO:BufFileRead and IO:BufFileWrite.",
  "io:buffilewrite": "When operations require more memory than the amount defined by working memory parameters, the engine creates temporary files on disk. This wait event occurs when operations write to the temporary files. For more information, see IO:BufFileRead and IO:BufFileWrite.",
  "io:controlfileread": "A process is waiting for a read from the pg_control file.",
  "io:controlfilesync": "A process is waiting for the pg_control file to reach durable storage.",
  "io:controlfilesyncupdate": "A process is waiting for an update to the pg_control file to reach durable storage.",
  "io:controlfilewrite": "A process is waiting for a write to the pg_control file.",
  "io:controlfilewriteupdate": "A process is waiting for a write to update the pg_control file.",
  "io:copyfileread": "A process is waiting for a read during a file copy operation.",
  "io:copyfilewrite": "A process is waiting for a write during a file copy operation.",
  "io:datafileextend": "A process is waiting for a relation data file to be extended.",
  "io:datafileflush": "A process is waiting for a relation data file to reach durable storage.",
  "io:datafileimmediatesync": "A process is waiting for an immediate synchronization of a relation data file to durable storage.",
  "io:datafileprefetch": "A process is waiting for an asynchronous prefetch from a relation data file.",
  "io:datafilesync": "A process is waiting for changes to a relation data file to reach durable storage.",
  "io:datafileread": "A backend process tried to find a page in the shared buffers, didn't find it, and so read it from storage. For more information, see IO:DataFileRead.",
  "io:datafiletruncate": "A process is waiting for a relation data file to be truncated.",
  "io:datafilewrite": "A process is waiting for a write to a relation data file.",
  "io:dsmfillzerowrite": "A process is waiting to write zero bytes to a dynamic shared memory backing file.",
  "io:lockfileaddtodatadirread": "A process is waiting for a read while adding a line to the data directory lock file.",
  "io:lockfileaddtodatadirsync": "A process is waiting for data to reach durable storage while adding a line to the data directory lock file.",
  "io:lockfileaddtodatadirwrite": "A process is waiting for a write while adding a line to the data directory lock file.",
  "io:lockfilecreateread": "A process is waiting to read while creating the data directory lock file.",
  "io:lockfilecreatesync": "A process is waiting for data to reach durable storage while creating the data directory lock file.",
  "io:lockfilecreatewrite": "A process is waiting for a write while creating the data directory lock file.",
  "io:lockfilerecheck datadirread": "A process is waiting for a read during recheck of the data directory lock file.",
  "io:logicalrewritecheckpointsync": "A process is waiting for logical rewrite mappings to reach durable storage during a checkpoint.",
  "io:logicalrewritemappingsync": "A process is waiting for mapping data to reach durable storage during a logical rewrite.",
  "io:logicalrewritemappingwrite": "A process is waiting for a write of mapping data during a logical rewrite.",
  "io:logicalrewritesync": "A process is waiting for logical rewrite mappings to reach durable storage.",
  "io:logicalrewritetruncate": "A process is waiting for the truncation of mapping data during a logical rewrite.",
  "io:logicalrewritewrite": "A process is waiting for a write of logical rewrite mappings.",
  "io:relationmapread": "A process is waiting for a read of the relation map file.",
  "io:relationmapsync": "A process is waiting for the relation map file to reach durable storage.",
  "io:relationmapwrite": "A process is waiting for a write to the relation map file.",
  "io:reorderbufferread": "A process is waiting for a read during reorder buffer management.",
  "io:reorderbufferwrite": "A process is waiting for a write during reorder buffer management.",
  "io:reorderlogicalmappingread": "A process is waiting for a read of a logical mapping during reorder buffer management.",
  "io:replicationslotread": "A process is waiting for a read from a replication slot control file.",
  "io:replicationslotrestoresync": "A process is waiting for a replication slot control file to reach durable storage while restoring it to memory.", 
  "io:replicationslotync": "A process is waiting for a replication slot control file to reach durable storage.",
  "io:replicationslotwrite": "A process is waiting for a write to a replication slot control file.",
  "io:slruflushsync": "A process is waiting for simple least-recently used (SLRU) data to reach durable storage during a checkpoint or database shutdown.",
  "io:slruread": "A process is waiting for a read of a simple least-recently used (SLRU) page.",
  "io:slrusync": "A process is waiting for simple least-recently used (SLRU) data to reach durable storage following a page write.", 
  "io:slruwrite": "A process is waiting for a write of a simple least-recently used (SLRU) page.",
  "io:snapbuildread": "A process is waiting for a read of a serialized historical catalog snapshot.",
  "io:snapbuildsync": "A process is waiting for a serialized historical catalog snapshot to reach durable storage.", 
  "io:snapbuildwrite": "A process is waiting for a write of a serialized historical catalog snapshot.",
  "io:timelinehistoryfilesync": "A process is waiting for a timeline history file received through streaming replication to reach durable storage.",
  "io:timelinehistoryfilewrite": "A process is waiting for a write of a timeline history file received through streaming replication.",
  "io:timelinehistoryread": "A process is waiting for a read of a timeline history file.",
  "io:timelinehistorysync": "A process is waiting for a newly created timeline history file to reach durable storage.", 
  "io:timelinehistorywrite": "A process is waiting for a write of a newly created timeline history file.",
  "io:twophasefileread": "A process is waiting for a read of a two phase state file.", 
  "io:twophasefilesync": "A process is waiting for a two phase state file to reach durable storage.",
  "io:twophasefilewrite": "A process is waiting for a write of a two phase state file.",
  "io:walbootstrapsync": "A process is waiting for the write-ahead log (WAL) to reach durable storage during bootstrapping.",
  "io:walbootstrapwrite": "A process is waiting for a write of a write-ahead log (WAL) page during bootstrapping.",
  "io:walcopyread": "A process is waiting for a read when creating a new write-ahead log (WAL) segment by copying an existing one.",
  "io:walcopysync": "A process is waiting for a new write-ahead log (WAL) segment created by copying an existing one to reach durable storage.",
  "io:walcopywrite": "A process is waiting for a write when creating a new write-ahead log (WAL) segment by copying an existing one.", 
  "io:walinitsync": "A process is waiting for a newly initialized write-ahead log (WAL) file to reach durable storage.",
  "io:walinitwrite": "A process is waiting for a write while initializing a new write-ahead log (WAL) file.",
  "io:walread": "A process is waiting for a read from a write-ahead log (WAL) file.",
  "io:walsendertimelinehistoryread": "A process is waiting for a read from a timeline history file during a WAL sender timeline command.",
  "io:walsync": "A process is waiting for a write-ahead log (WAL) file to reach durable storage.",
  "io:walsyncmethodassign": "A process is waiting for data to reach durable storage while assigning a new write-ahead log (WAL) sync method.", 
  "io:walwrite": "A process is waiting for a write to a write-ahead log (WAL) file.",
  "io:xactsync": "A backend process is waiting for the Aurora storage subsystem to acknowledge the commit of a regular transaction, or the commit or rollback of a prepared transaction. For more information, see IO:XactSync.",
  "ipc:backupwaitwalarchiive": "A process is waiting for write-ahead log (WAL) files required for a backup to be successfully archived.",
  "ipc:auroraoptimizedreadscachewritestop": "A process is waiting for the background writer to stop writing into Optimized Reads tiered cache.",
  "ipc:bgworkershutdown": "A process is waiting for a background worker to shut down.",
  "ipc:bgworkerstartup": "A process is waiting for a background worker to start.",
  "ipc:btreepage": "A process is waiting for the page number needed to continue a parallel B-tree scan to become available.",
  "ipc:checkpointdone": "A process is waiting for a checkpoint to complete.",
  "ipc:checkpointstart": "A process is waiting for a checkpoint to start.",
  "ipc:cloggroupupdate": "A process is waiting for the group leader to update the transaction status at a transaction's end.",
  "ipc:damrecordtxack": "A backend process has generated a database activity streams event and is waiting for the event to become durable. For more information, see IPC:DamRecordTxAck.",
  "ipc:executegather": "A process is waiting for activity from a child process while executing a Gather plan node.",
  "ipc:hash/batch/allocating": "A process is waiting for an elected parallel hash participant to allocate a hash table.",
  "ipc:hash/batch/electing": "A process is electing a parallel hash participant to allocate a hash table.", 
  "ipc:hash/batch/loading": "A process is waiting for other parallel hash participants to finish loading a hash table.",
  "ipc:hash/build/allocating": "A process is waiting for an elected parallel hash participant to allocate the initial hash table.",
  "ipc:hash/build/electing": "A process is electing a parallel hash participant to allocate the initial hash table.",
  "ipc:hash/build/hashinginner": "A process is waiting for other parallel hash participants to finish hashing the inner relation.", 
  "ipc:hash/build/hashingouuter": "A process is waiting for other parallel hash participants to finish partitioning the outer relation.",
  "ipc:hash/growbatches/allocating": "A process is waiting for an elected parallel hash participant to allocate more batches.",
  "ipc:hash/growbatches/deciding": "A process is electing a parallel hash participant to decide on future batch growth.",
  "ipc:hash/growbatches/electing": "A process is electing a parallel hash participant to allocate more batches.",
  "ipc:hash/growbatches/finishing": "A process is waiting for an elected parallel hash participant to decide on future batch growth.",
  "ipc:hash/growbatches/repartitioning": "A process is waiting for other parallel hash participants to finishing repartitioning.",
  "ipc:hash/growbuckets/allocating": "A process is waiting for an elected parallel hash participant to finish allocating more buckets.",
  "ipc:hash/growbuckets/electing": "A process is electing a parallel hash participant to allocate more buckets.",
  "ipc:hash/growbuckets/reinserting": "A process is waiting for other parallel hash participants to finish inserting tuples into new buckets.",
  "ipc:hashbatchallocate": "A process is waiting for an elected parallel hash participant to allocate a hash table.",
  "ipc:hashbatchelect": "A process is waiting to elect a parallel hash participant to allocate a hash table.",
  "ipc:hashbatchload": "A process is waiting for other parallel hash participants to finish loading a hash table.",
  "ipc:hashbuildallocate": "A process is waiting for an elected parallel hash participant to allocate the initial hash table.",
  "ipc:hashbuildelect": "A process is waiting to elect a parallel hash participant to allocate the initial hash table.",
  "ipc:hashbuildhashinner": "A process is waiting for other parallel hash participants to finish hashing the inner relation.",
  "ipc:hashbuildhashouter": "A process is waiting for other parallel hash participants to finish partitioning the outer relation.",
  "ipc:hashgrowbatchesallocate": "A process is waiting for an elected parallel hash participant to allocate more batches.",
  "ipc:hashgrowbatchesdecide": "A process is waiting to elect a parallel hash participant to decide on future batch growth.",
  "ipc:hashgrowbatcheselect": "A process is waiting to elect a parallel hash participant to allocate more batches.",
  "ipc:hashgrowbatchesfinish": "A process is waiting for an elected parallel hash participant to decide on future batch growth.",
  "ipc:hashgrowbatchesrepartition": "A process is waiting for other parallel hash participants to finish repartitioning.",
  "ipc:hashgrowbucketsallocate": "A process is waiting for an elected parallel hash participant to finish allocating more buckets.",
  "ipc:hashgrowbucketselect": "A process is waiting to elect a parallel hash participant to allocate more buckets.",
  "ipc:hashgrowbucketsreinsert": "A process is waiting for other parallel hash participants to finish inserting tuples into new buckets.",
  "ipc:logicalsyncdata": "A process is waiting for a logical replication remote server to send data for initial table synchronization.",
  "ipc:logicalsyncstatechange": "A process is waiting for a logical replication remote server to change state.",
  "ipc:messagequeueinternaal": "A process is waiting for another process to be attached to a shared message queue.",
  "ipc:messagequeueputmessage": "A process is waiting to write a protocol message to a shared message queue.",
  "ipc:messagequeuereceive": "A process is waiting to receive bytes from a shared message queue.", 
  "ipc:messagequeuesend": "A process is waiting to send bytes to a shared message queue.",
  "ipc:parallelbitmapscan": "A process is waiting for a parallel bitmap scan to become initialized.",
  "ipc:parallelcreateindexscan": "A process is waiting for parallel CREATE INDEX workers to finish a heap scan.",
  "ipc:parallelfinish": "A process is waiting for parallel workers to finish computing.",
  "ipc:procarraylgroupupdate": "A process is waiting for the group leader to clear the transaction ID at the end of a parallel operation.",
  "ipc:procsignalbarrier": "A process is waiting for a barrier event to be processed by all backends.",
  "ipc:promote": "A process is waiting for standby promotion.",
  "ipc:recoveryconflictsnapshot": "A process is waiting for recovery conflict resolution for a vacuum cleanup.",
  "ipc:recoveryconflicttablespace": "A process is waiting for recovery conflict resolution for dropping a tablespace.",
  "ipc:recoverypause": "A process is waiting for recovery to be resumed.",
  "ipc:replicationorigindrop": "A process is waiting for a replication origin to become inactive so it can be dropped.",
  "ipc:replicationslotdrop": "A process is waiting for a replication slot to become inactive so it can be dropped.",
  "ipc:safesnapshot": "A process is waiting to obtain a valid snapshot for a READ ONLY DEFERRABLE transaction.",
  "ipc:syncrep": "A process is waiting for confirmation from a remote server during synchronous replication.",
  "ipc:xactgroupupdate": "A process is waiting for the group leader to update the transaction status at the end of a parallel operation.",
  "lock:advisory": "A backend process requested an advisory lock and is waiting for it. For more information, see Lock:advisory.",
  "lock:extend": "A backend process is waiting for a lock to be released so that it can extend a relation. This lock is needed because only one backend process can extend a relation at a time. For more information, see Lock:extend.",
  "lock:frozenid": "A process is waiting to update pg_database.datfrozenxid and pg_database.datminmxid.",
  "lock:object": "A process is waiting to get a lock on a nonrelation database object.", 
  "lock:page": "A process is waiting to get a lock on a page of a relation.",
  "lock:relation": "A backend process is waiting to acquire a lock on a relation that is locked by another transaction. For more information, see Lock:Relation.",
  "lock:spectoken": "A process is waiting to get a speculative insertion lock.",
  "lock:speculativetoken": "A process is waiting to acquire a speculative insertion lock.", 
  "lock:transactionid": "A transaction is waiting for a row-level lock. For more information, see Lock:transactionid.",
  "lock:tuple": "A backend process is waiting to acquire a lock on a tuple while another backend process holds a conflicting lock on the same tuple. For more information, see Lock:tuple.",
  "lock:userlock": "A process is waiting to get a user lock.",
  "lock:virtualxid": "A process is waiting to get a virtual transaction ID lock.",
  "lwlock:addinshmeminit": "A process is waiting to manage an extension's space allocation in shared memory.",
  "lwlock:addinshmeminitlock": "A process is waiting to manage space allocation in shared memory.",
  "lwlock:async": "A process is waiting for I/O on an async (notify) buffer.",
  "lwlock:asyncctllock": "A process is waiting to read or update a shared notification state.",
  "lwlock:asyncqueuelock": "A process is waiting to read or update notification messages.",
  "lwlock:auroraoptimizedreadscachemapping": "A process is waiting to associate a data block with a page in the Optimized Reads tiered cache.",
  "lwlock:autofile": "A process is waiting to update the postgresql.auto.conf file.", 
  "lwlock:autofilelock": "A process is waiting to update the postgresql.auto.conf file.",
  "lwlock:autovacuum": "A process is waiting to read or update the current state of autovacuum workers.",
  "lwlock:autovacuumlock": "An autovacuum worker or launcher is waiting to update or read the current state of autovacuum workers.",
  "lwlock:autovacuumschedule": "A process is waiting to ensure that a table selected for autovacuum still needs vacuuming.",
  "lwlock:autovacuumschedulelock": "A process is waiting to ensure that the table it has selected for a vacuum still needs vacuuming.",
  "lwlock:backendrandomlock": "A process is waiting to generate a random number.",
  "lwlock:backgroundworker": "A process is waiting to read or update background worker state.",
  "lwlock:backgroundworkerlock": "A process is waiting to read or update the background worker state.", 
  "lwlock:btreevacuum": "A process is waiting to read or update vacuum-related information for a B-tree index.",
  "lwlock:btreevacuumlock": "A process is waiting to read or update vacuum-related information for a B-tree index.",
  "lwlock:buffer_content": "A backend process is waiting to acquire a lightweight lock on the contents of a shared memory buffer. For more information, see LWLock:buffer_content (BufferContent).",
  "lwlock:buffer_mapping": "A backend process is waiting to associate a data block with a buffer in the shared buffer pool. For more information, see LWLock:buffer_mapping.",
  "lwlock:bufferio": "A backend process wants to read a page into shared memory. The process is waiting for other processes to finish their I/O for the page. For more information, see LWLock:BufferIO (IPC:BufferIO).",
  "lwlock:checkpoint": "A process is waiting to begin a checkpoint.",
  "lwlock:checkpointlock": "A process is waiting to perform checkpoint.", 
  "lwlock:checkpointercomm": "A process is waiting to manage fsync requests.",
  "lwlock:checkpointercommlock": "A process is waiting to manage fsync requests.",
  "lwlock:clog": "A process is waiting for I/O on a clog (transaction status) buffer.",
  "lwlock:clogcontrollock": "A process is waiting to read or update transaction status.",
  "lwlock:clogtruncationlock": "A process is waiting to run txid_status or update the oldest transaction ID available to it.",
  "lwlock:commit_timestamp": "A process is waiting for I/O on a commit timestamp buffer.",
  "lwlock:committss": "A process is waiting to read or update the last value set for a transaction commit timestamp.",
  "lwlock:committssbuffer": "A process is waiting for I/O on a simple least-recently used (SLRU) buffer for a commit timestamp.",
  "lwlock:committscontrollock": "A process is waiting to read or update transaction commit timestamps.", 
  "lwlock:commitslock": "A process is waiting to read or update the last value set for the transaction timestamp.",
  "lwlock:committsslru": "A process is waiting to access the simple least-recently used (SLRU) cache for a commit timestamp.",
  "lwlock:controlfile": "A process is waiting to read or update the pg_control file or create a new write-ahead log (WAL) file.",
  "lwlock:controlfilelock": "A process is waiting to read or update the control file or creation of a new write-ahead log (WAL) file.",
  "lwlock:dynamicsharedmemorycontrol": "A process is waiting to read or update dynamic shared memory allocation information.",
  "lwlock:dynamicsharedmemorycontrollock": "A process is waiting to read or update the dynamic shared memory state.",
  "lwlock:lock_manager": "A backend process is waiting to add or examine locks for backend processes. Or it's waiting to join or exit a locking group that is used by parallel query. For more information, see LWLock:lock_manager.",
  "lwlock:lockfastpath": "A process is waiting to read or update a process's fast-path lock information.",
  "lwlock:logicalrepworker": "A process is waiting to read or update the state of logical replication workers.",
  "lwlock:logicalrepworkerlock": "A process is waiting for an action on a logical replication worker to finish.",
  "lwlock:multixact_member": "A process is waiting for I/O on a multixact_member buffer.", 
  "lwlock:multixact_offset": "A process is waiting for I/O on a multixact offset buffer.",
  "lwlock:multixactgen": "A process is waiting to read or update shared multixact state.",
  "lwlock:multixactgenlock": "A process is waiting to read or update a shared multixact state.", 
  "lwlock:multixactmemberbuffer": "A process is waiting for I/O on a simple least-recently used (SLRU) buffer for a multixact member. For more information, see LWLock:MultiXact.",
  "lwlock:multixactmembercontrollock": "A process is waiting to read or update multixact member mappings.",
  "lwlock:multixactmemberslru": "A process is waiting to access the simple least-recently used (SLRU) cache for a multixact member. For more information, see LWLock:MultiXact.",
  "lwlock:multixactoffsetbuffer": "A process is waiting for I/O on a simple least-recently used (SLRU) buffer for a multixact offset. For more information, see LWLock:MultiXact.",
  "lwlock:multixactoffsetcontrollock": "A process is waiting to read or update multixact offset mappings.",
  "lwlock:multixactoffsetslru": "A process is waiting to access the simple least-recently used (SLRU) cache for a multixact offset. For more information, see LWLock:MultiXact.",
  "lwlock:multixacttruncation": "A process is waiting to read or truncate multixact information.",
  "lwlock:multixacttruncationlock": "A process is waiting to read or truncate multixact information.",
  "lwlock:notifybuffer": "A process is waiting for I/O on the simple least-recently used (SLRU) buffer for a NOTIFY message.",
  "lwlock:notifyqueue": "A process is waiting to read or update NOTIFY messages.", 
  "lwlock:notifyqueuetail": "A process is waiting to update a limit on NOTIFY message storage.",
  "lwlock:notifyqueuetaillock": "A process is waiting to update limit on notification message storage.",
  "lwlock:notifyslru": "A process is waiting to access the simple least-recently used (SLRU) cache for a NOTIFY message.",
  "lwlock:oidgen": "A process is waiting to allocate a new object ID (OID).",
  "lwlock:oidgenlock": "A process is waiting to allocate or assign an object ID (OID).", 
  "lwlock:oldserxid": "A process is waiting for I/O on an oldserxid buffer.",
  "lwlock:oldserxidlock": "A process is waiting to read or record conflicting serializable transactions.",
  "lwlock:oldsnapshotttimemap": "A process is waiting to read or update old snapshot control information.", 
  "lwlock:oldsnapshotttimemaplock": "A process is waiting to read or update old snapshot control information.",
  "lwlock:parallel_append": "A process is waiting to choose the next subplan during parallel append plan execution.",
  "lwlock:parallel_hash_join": "A process is waiting to allocate or exchange a chunk of memory or update counters during a parallel hash plan execution.",
  "lwlock:parallel_query_dsa": "A process is waiting for a lock on dynamic shared memory allocation for a parallel query.",
  "lwlock:parallelappend": "A process is waiting to choose the next subplan during parallel append plan execution.",
  "lwlock:parallelhashjoin": "A process is waiting to synchronize workers during plan execution for a parallel hash join.",
  "lwlock:parallelquerydsa": "A process is waiting for dynamic shared memory allocation for a parallel query.",
  "lwlock:persessiondsa": "A process is waiting for dynamic shared memory allocation for a parallel query.",
  "lwlock:persessionrecordtype": "A process is waiting to access a parallel query's information about composite types.",
  "lwlock:persessionrecordtypmod": "A process is waiting to access a parallel query's information about type modifiers that identify anonymous record types.",
  "lwlock:perxactpredicatelist": "A process is waiting to access the list of predicate locks held by the current serializable transaction during a parallel query.",
  "lwlock:predicate_lock_manager": "A process is waiting to add or examine predicate lock information.",
  "lwlock:predicatelockmanager": "A process is waiting to access predicate lock information used by serializable transactions.",
  "lwlock:proc": "A process is waiting to read or update the fast-path lock information.",
  "lwlock:procarray": "A process is waiting to access the shared per-process data structures (typically, to get a snapshot or report a session's transaction ID).",
  "lwlock:procarraylock": "A process is waiting to get a snapshot or clearing a transaction Id at a transaction's end.", 
  "lwlock:relationmapping": "A process is waiting to read or update a pg_filenode.map file (used to track the file-node assignments of certain system catalogs).",
  "lwlock:relationmappinglock": "A process is waiting to update the relation map file used to store catalog-to-file-node mapping.",
  "lwlock:relcacheinit": "A process is waiting to read or update a pg_internal.init file (a relation cache initialization file).",
  "lwlock:relcacheinitlock": "A process is waiting to read or write a relation cache initialization file.",
  "lwlock:replication_origin": "A process is waiting to read or update the replication progress.", 
  "lwlock:replication_slot_io": "A process is waiting for I/O on a replication slot.",
  "lwlock:replicationorigin": "A process is waiting to create, drop, or use a replication origin.",
  "lwlock:replicationoriginlock": "A process is waiting to set up, drop, or use a replication origin.",
  "lwlock:replicationoriginstate": "A process is waiting to read or update the progress of one replication origin.",
  "lwlock:replicationslotallocation": "A process is waiting to allocate or free a replication slot.", 
  "lwlock:replicationslotallocationlock": "A process is waiting to allocate or free a replication slot.",
  "lwlock:replicationslotcontrol": "A process is waiting to read or update a replication slot state.",
  "lwlock:replicationslotcontrollock": "A process is waiting to read or update the replication slot state.", 
  "lwlock:replicationslotio": "A process is waiting for I/O on a replication slot.",
  "lwlock:serialbuffer": "A process is waiting for I/O on a simple least-recently used (SLRU) buffer for a serializable transaction conflict.",
  "lwlock:serializablefinishedlist": "A process is waiting to access the list of finished serializable transactions.",
  "lwlock:serializablefinishedlistlock": "A process is waiting to access the list of finished serializable transactions.",
  "lwlock:serializablepredicatelist": "A process is waiting to access the list of predicate locks held by serializable transactions.",
  "lwlock:serializablepredicatelocklistlock": "A process is waiting to perform an operation on a list of locks held by serializable transactions.",
  "lwlock:serializablexacthash": "A process is waiting to read or update information about serializable transactions.",
  "lwlock:serializablexacthashlock": "A process is waiting to retrieve or store information about serializable transactions.",
  "lwlock:serialslru": "A process is waiting to access the simple least-recently used (SLRU) cache for a serializable transaction conflict.",
  "lwlock:sharedtidbitmap": "A process is waiting to access a shared tuple identifier (TID) bitmap during a parallel bitmap index scan.",
  "lwlock:sharedtuplestore": "A process is waiting to access a shared tuple store during a parallel query.",
  "lwlock:shmemindex": "A process is waiting to find or allocate space in shared memory.",
  "lwlock:shmemindexlock": "A process is waiting to find or allocate space in shared memory.", 
  "lwlock:sinvalread": "A process is waiting to retrieve messages from the shared catalog invalidation queue.",
  "lwlock:sinvalreadlock": "A process is waiting to retrieve or remove messages from a shared invalidation queue.", 
  "lwlock:sinvalwrite": "A process is waiting to add a message to the shared catalog invalidation queue.",
  "lwlock:sinvalwritelock": "A process is waiting to add a message in a shared invalidation queue.",
  "lwlock:subtrans": "A process is waiting for I/O on a subtransaction buffer.",
  "lwlock:subtransbuffer": "A process is waiting for I/O on a simple least-recently used (SLRU) buffer for a subtransaction.",
  "lwlock:subtranscontrollock": "A process is waiting to read or update subtransaction information.", 
  "lwlock:subtransslru": "A process is waiting to access the simple least-recently used (SLRU) cache for a subtransaction.",
  "lwlock:syncrep": "A process is waiting to read or update information about the state of synchronous replication.",
  "lwlock:syncreplock": "A process is waiting to read or update information about synchronous replicas.",
  "lwlock:syncscan": "A process is waiting to select the starting location of a synchronized table scan.", 
  "lwlock:syncscanlock": "A process is waiting to get the start location of a scan on a table for synchronized scans.",
  "lwlock:tablespacecreate": "A process is waiting to create or drop a tablespace.",
  "lwlock:tablespacecreatelock": "A process is waiting to create or drop the tablespace.",
  "lwlock:tbm": "A process is waiting for a shared iterator lock on a tree bitmap (TBM).",
  "lwlock:twophasestate": "A process is waiting to read or update the state of prepared transactions.",
  "lwlock:twophasestatelock": "A process is waiting to read or update the state of prepared transactions.", 
  "lwlock:wal_insert": "A process is waiting to insert the write-ahead log (WAL) into a memory buffer.",
  "lwlock:walbufmapping": "A process is waiting to replace a page in write-ahead log (WAL) buffers.",
  "lwlock:walbufmappinglock": "A process is waiting to replace a page in write-ahead log (WAL) buffers.",
  "lwlock:walinsert": "A process is waiting to insert write-ahead log (WAL) data into a memory buffer.",
  "lwlock:walwrite": "A process is waiting for write-ahead log (WAL) buffers to be written to disk.",
  "lwlock:walwritelock": "A process is waiting for write-ahead log (WAL) buffers to be written to disk.",
  "lwlock:wraplimitsvacuum": "A process is waiting to update limits on transaction ID and multixact consumption.",
  "lwlock:wraplimitsvacuumlock": "A process is waiting to update limits on transaction ID and multixact consumption.", 
  "lwlock:xactbuffer": "A process is waiting for I/O on a simple least-recently used (SLRU) buffer for a transaction status.",
  "lwlock:xactslru": "A process is waiting to access the simple least-recently used (SLRU) cache for a transaction status.",
  "lwlock:xacttruncation": "A process is waiting to run pg_xact_status or update the oldest transaction ID available to it.",
  "lwlock:xidgen": "A process is waiting to allocate a new transaction ID.", 
  "lwlock:xidgenlock": "A process is waiting to allocate or assign a transaction ID.",
  "timeout:basebackupthrottle": "A process is waiting during base backup when throttling activity.", 
  "timeout:pgsleep": "A backend process has called the pg_sleep function and is waiting for the sleep timeout to expire. For more information, see Timeout:PgSleep.",
  "timeout:recoveryapplydelay": "A process is waiting to apply write-ahead log (WAL) during recovery because of a delay setting.",
  "timeout:recoveryretrieveretryinterval": "A process is waiting during recovery when write-ahead log (WAL) data is not available from any source (pg_wal, archive, or stream).",
  "timeout:vacuumdelay": "A process is waiting in a cost-based vacuum delay point."
}